[NoCoverage] BlockStatement
src/notifications/notifications.service.ts:10:26
   constructor(private readonly tasksService: TasksService) {}
 
   @Cron(CronExpression.EVERY_DAY_AT_MIDNIGHT)
-  async checkDeadlines() {
-    console.log('[Scheduler] Checking deadlines...');
-
-    const overdue = await this.tasksService.findOverdueTasks();
-
-    if (overdue.length === 0) {
-      console.log('[Scheduler] No overdue tasks.');
-      return;
-    }
-
-    console.log('[Scheduler] Overdue tasks found:');
-    overdue.forEach((task) => {
-      console.log(
-        `Task ${task.id} (episode ${task.episodeNumber}, type ${task.type}) is overdue.`,
-      );
-    });
-  }
+  async checkDeadlines() {}
 }
 

[NoCoverage] BlockStatement
src/notifications/notifications.service.ts:15:31
 
     const overdue = await this.tasksService.findOverdueTasks();
 
-    if (overdue.length === 0) {
-      console.log('[Scheduler] No overdue tasks.');
-      return;
-    }
+    if (overdue.length === 0) {}
 
     console.log('[Scheduler] Overdue tasks found:');

[NoCoverage] ConditionalExpression
src/notifications/notifications.service.ts:15:9
 
     const overdue = await this.tasksService.findOverdueTasks();
 
-    if (overdue.length === 0) {
+    if (false) {
       console.log('[Scheduler] No overdue tasks.');
       return;

[NoCoverage] StringLiteral
src/notifications/notifications.service.ts:16:19
     const overdue = await this.tasksService.findOverdueTasks();
 
     if (overdue.length === 0) {
-      console.log('[Scheduler] No overdue tasks.');
+      console.log("");
       return;
     }

[NoCoverage] BlockStatement
src/notifications/notifications.service.ts:21:31
     }
 
     console.log('[Scheduler] Overdue tasks found:');
-    overdue.forEach((task) => {
-      console.log(
-        `Task ${task.id} (episode ${task.episodeNumber}, type ${task.type}) is overdue.`,
-      );
-    });
+    overdue.forEach((task) => {});
   }
 }
