[NoCoverage] BlockStatement
src/projects/projects.controller.ts:14:47
   ) {}
 
   @Post()
-  async create(@Body() dto: CreateProjectDto) {
-    const project = await this.projectsService.create(dto);
-    this.tasksService.createInitialTasks(project.id, project.totalEpisodes);
-    return project;
-  }
+  async create(@Body() dto: CreateProjectDto) {}
 
   @Get()

[NoCoverage] BlockStatement
src/projects/projects.controller.ts:21:19
   }
 
   @Get()
-  async findAll() {
-    return await this.projectsService.findAll();
-  }
+  async findAll() {}
 
   @Get(':id')

[NoCoverage] BlockStatement
src/projects/projects.controller.ts:26:42
   }
 
   @Get(':id')
-  async findOne(@Param('id') id: string) {
-    return await this.projectsService.findOne(id);
-  }
+  async findOne(@Param('id') id: string) {}
 
   @Get(':id/progress')

[NoCoverage] BlockStatement
src/projects/projects.controller.ts:31:53
   }
 
   @Get(':id/progress')
-  async getProjectProgress(@Param('id') id: string) {
-    return {
-      projectId: id,
-      progress: await this.tasksService.getProjectProgress(id),
-    };
-  }
+  async getProjectProgress(@Param('id') id: string) {}
 
   @Get(':id/episodes/:episodeNumber/progress')

[NoCoverage] ObjectLiteral
src/projects/projects.controller.ts:32:12
 
   @Get(':id/progress')
   async getProjectProgress(@Param('id') id: string) {
-    return {
-      projectId: id,
-      progress: await this.tasksService.getProjectProgress(id),
-    };
+    return {};
   }
 

[NoCoverage] BlockStatement
src/projects/projects.controller.ts:42:5
   async getEpisodeProgress(
     @Param('id') id: string,
     @Param('episodeNumber') episodeNumber: string,
-  ) {
-    const ep = parseInt(episodeNumber, 10);
-    return {
-      projectId: id,
-      episodeNumber: ep,
-      progress: await this.tasksService.getEpisodeProgress(id, ep),
-    };
-  }
+  ) {}
 }
 

[NoCoverage] ObjectLiteral
src/projects/projects.controller.ts:44:12
     @Param('episodeNumber') episodeNumber: string,
   ) {
     const ep = parseInt(episodeNumber, 10);
-    return {
-      projectId: id,
-      episodeNumber: ep,
-      progress: await this.tasksService.getEpisodeProgress(id, ep),
-    };
+    return {};
   }
 }
