[NoCoverage] BlockStatement
src/projects/projects.service.ts:10:57
 export class ProjectsService {
   constructor(private prisma: PrismaService) {}
 
-  async create(dto: CreateProjectDto): Promise<Project> {
-    return this.prisma.project.create({ data: dto });
-  }
+  async create(dto: CreateProjectDto): Promise<Project> {}
 
   async findAll() {

[NoCoverage] BlockStatement
src/projects/projects.service.ts:14:19
     return this.prisma.project.create({ data: dto });
   }
 
-  async findAll() {
-    return this.prisma.project.findMany();
-  }
+  async findAll() {}
 
   async findOne(id: string) {

[NoCoverage] BlockStatement
src/projects/projects.service.ts:18:29
     return this.prisma.project.findMany();
   }
 
-  async findOne(id: string) {
-    return this.prisma.project.findUnique({
-      where: { id },
-      include: { tasks: true },
-    });
-  }
+  async findOne(id: string) {}
 }
 

[NoCoverage] ObjectLiteral
src/projects/projects.service.ts:20:14
 
   async findOne(id: string) {
     return this.prisma.project.findUnique({
-      where: { id },
+      where: {},
       include: { tasks: true },
     });

[NoCoverage] BooleanLiteral
src/projects/projects.service.ts:21:25
   async findOne(id: string) {
     return this.prisma.project.findUnique({
       where: { id },
-      include: { tasks: true },
+      include: { tasks: false },
     });
   }
