[NoCoverage] BlockStatement
src/tasks/tasks.controller.ts:12:18
   constructor(private readonly tasksService: TasksService) {}
 
   @Get()
-  async getAll() {
-    return await this.tasksService.getAll();
-  }
+  async getAll() {}
 
   @Patch(':id/status')

[NoCoverage] BlockStatement
src/tasks/tasks.controller.ts:20:5
   async updateStatus(
     @Param('id') id: string,
     @Body() dto: UpdateTaskStatusDto,
-  ) {
-    return await this.tasksService.updateStatus(id, dto.status);
-  }
+  ) {}
 
   @Patch(':id/deadline')

[NoCoverage] BlockStatement
src/tasks/tasks.controller.ts:28:5
   async updateDeadline(
     @Param('id') id: string,
     @Body() dto: UpdateTaskDeadlineDto,
-  ) {
-    return await this.tasksService.updateDeadline(id, dto.deadline);
-  }
+  ) {}
 
   @Patch(':id/assign')

[NoCoverage] BlockStatement
src/tasks/tasks.controller.ts:33:69
   }
 
   @Patch(':id/assign')
-  async assign(@Param('id') id: string, @Body() dto: AssignTaskDto) {
-    return await this.tasksService.assignUser(id, dto.userName);
-  }
+  async assign(@Param('id') id: string, @Body() dto: AssignTaskDto) {}
 }
 
