[Killed] StringLiteral
src/tasks/tasks.service.ts:11:5
   constructor(private prisma: PrismaService) {}
 
   private readonly processTypes: TaskType[] = [
-    'translation',
+    "",
     'editing',
     'casting',
killedBy: TasksService should create initial tasks
statusReason: PrismaClientKnownRequestError: 
Invalid `prisma.project.create()` invocation in
/Users/jestak/WebstormProjects/NodeJS-Course3/.stryker-tmp/sandbox-6iIzKe/src/tasks/tasks.service.integration.spec.ts:35:26

  32 });
  33 
  34 it('should create initial tasks', async () => {
→ 35   await prisma.project.create(

[Killed] StringLiteral
src/tasks/tasks.service.ts:17:5
     'recording',
     'correctionWriting',
     'correctionRecording',
-    'mixing',
+    "",
   ];
 
killedBy: TasksService should get project progress
statusReason: PrismaClientKnownRequestError: 
Invalid `prisma.task.createMany()` invocation in
/Users/jestak/WebstormProjects/NodeJS-Course3/.stryker-tmp/sandbox-6iIzKe/src/tasks/tasks.service.integration.spec.ts:186:23

  183   },
  184 });
  185 
→ 186 await prisma.task.createMany(

[Killed] BlockStatement
src/tasks/tasks.service.ts:20:70
     'mixing',
   ];
 
-  async createInitialTasks(projectId: string, totalEpisodes: number) {
-    const tasksToCreate: Task[] = [];
-
-    for (let ep = 1; ep <= totalEpisodes; ep++) {
-      for (const type of this.processTypes) {
-        tasksToCreate.push({
-          projectId,
-          episodeNumber: ep,
-          type,
-          status: 'todo' as TaskStatus,
-          assignedTo: null,
-          deadline: null,
-        });
-      }
-    }
-
-    return this.prisma.task.createMany({
-      data: tasksToCreate,
-    });
-  }
+  async createInitialTasks(projectId: string, totalEpisodes: number) {}
 
   async getAll() {
killedBy: TasksService should create initial tasks
statusReason: PrismaClientKnownRequestError: 
Invalid `prisma.project.create()` invocation in
/Users/jestak/WebstormProjects/NodeJS-Course3/.stryker-tmp/sandbox-6iIzKe/src/tasks/tasks.service.integration.spec.ts:35:26

  32 });
  33 
  34 it('should create initial tasks', async () => {
→ 35   await prisma.project.create(

[Killed] ArrayDeclaration
src/tasks/tasks.service.ts:21:35
   ];
 
   async createInitialTasks(projectId: string, totalEpisodes: number) {
-    const tasksToCreate: Task[] = [];
+    const tasksToCreate: Task[] = ["Stryker was here"];
 
     for (let ep = 1; ep <= totalEpisodes; ep++) {
killedBy: TasksService should create initial tasks
statusReason: PrismaClientValidationError: 
Invalid `this.prisma.task.createMany()` invocation in
/Users/jestak/WebstormProjects/NodeJS-Course3/.stryker-tmp/sandbox-6iIzKe/src/tasks/tasks.service.ts:84:31

  81     }
  82   }
  83 }
→ 84 return this.prisma.task.createMany({

[Killed] BlockStatement
src/tasks/tasks.service.ts:23:49
   async createInitialTasks(projectId: string, totalEpisodes: number) {
     const tasksToCreate: Task[] = [];
 
-    for (let ep = 1; ep <= totalEpisodes; ep++) {
-      for (const type of this.processTypes) {
-        tasksToCreate.push({
-          projectId,
-          episodeNumber: ep,
-          type,
-          status: 'todo' as TaskStatus,
-          assignedTo: null,
-          deadline: null,
-        });
-      }
-    }
+    for (let ep = 1; ep <= totalEpisodes; ep++) {}
 
     return this.prisma.task.createMany({
killedBy: TasksService should create initial tasks
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 35
Received: 0

[Killed] EqualityOperator
src/tasks/tasks.service.ts:23:22
   async createInitialTasks(projectId: string, totalEpisodes: number) {
     const tasksToCreate: Task[] = [];
 
-    for (let ep = 1; ep <= totalEpisodes; ep++) {
+    for (let ep = 1; ep > totalEpisodes; ep++) {
       for (const type of this.processTypes) {
         tasksToCreate.push({
killedBy: TasksService should create initial tasks
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 35
Received: 0

[Killed] BlockStatement
src/tasks/tasks.service.ts:24:45
     const tasksToCreate: Task[] = [];
 
     for (let ep = 1; ep <= totalEpisodes; ep++) {
-      for (const type of this.processTypes) {
-        tasksToCreate.push({
-          projectId,
-          episodeNumber: ep,
-          type,
-          status: 'todo' as TaskStatus,
-          assignedTo: null,
-          deadline: null,
-        });
-      }
+      for (const type of this.processTypes) {}
     }
 
killedBy: TasksService should create initial tasks
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 35
Received: 0

[Timeout] BlockStatement
src/tasks/tasks.service.ts:41:18
     });
   }
 
-  async getAll() {
-    return this.prisma.task.findMany({
-      orderBy: { episodeNumber: 'asc' },
-    });
-  }
+  async getAll() {}
 
   async findOne(id: string) {

[Timeout] ObjectLiteral
src/tasks/tasks.service.ts:42:38
   }
 
   async getAll() {
-    return this.prisma.task.findMany({
-      orderBy: { episodeNumber: 'asc' },
-    });
+    return this.prisma.task.findMany({});
   }
 

[Timeout] StringLiteral
src/tasks/tasks.service.ts:43:33
 
   async getAll() {
     return this.prisma.task.findMany({
-      orderBy: { episodeNumber: 'asc' },
+      orderBy: { episodeNumber: "" },
     });
   }

[Killed] BlockStatement
src/tasks/tasks.service.ts:47:29
     });
   }
 
-  async findOne(id: string) {
-    return this.prisma.task.findUnique({
-      where: { id },
-    });
-  }
+  async findOne(id: string) {}
 
   async updateStatus(id: string, status: TaskStatus) {
killedBy: TasksService should find task by id
statusReason: PrismaClientKnownRequestError: 
Invalid `prisma.project.create()` invocation in
/Users/jestak/WebstormProjects/NodeJS-Course3/.stryker-tmp/sandbox-6iIzKe/src/tasks/tasks.service.integration.spec.ts:85:26

  82 });
  83 
  84 it('should find task by id', async () => {
→ 85   await prisma.project.create(

[Killed] ObjectLiteral
src/tasks/tasks.service.ts:49:14
 
   async findOne(id: string) {
     return this.prisma.task.findUnique({
-      where: { id },
+      where: {},
     });
   }
killedBy: TasksService should find task by id
statusReason: PrismaClientKnownRequestError: 
Invalid `prisma.task.create()` invocation in
/Users/jestak/WebstormProjects/NodeJS-Course3/.stryker-tmp/sandbox-6iIzKe/src/tasks/tasks.service.integration.spec.ts:93:36

  90   },
  91 });
  92 
→ 93 const task = await prisma.task.create(

[Killed] BlockStatement
src/tasks/tasks.service.ts:53:54
     });
   }
 
-  async updateStatus(id: string, status: TaskStatus) {
-    return this.prisma.task.update({
-      where: { id },
-      data: { status },
-    });
-  }
+  async updateStatus(id: string, status: TaskStatus) {}
 
   async updateDeadline(id: string, date: Date) {
killedBy: TasksService should update task status
statusReason: TypeError: Cannot read properties of undefined (reading 'status')

[Timeout] ObjectLiteral
src/tasks/tasks.service.ts:56:13
   async updateStatus(id: string, status: TaskStatus) {
     return this.prisma.task.update({
       where: { id },
-      data: { status },
+      data: {},
     });
   }

[Killed] BlockStatement
src/tasks/tasks.service.ts:60:48
     });
   }
 
-  async updateDeadline(id: string, date: Date) {
-    return this.prisma.task.update({
-      where: { id },
-      data: { deadline: date },
-    });
-  }
+  async updateDeadline(id: string, date: Date) {}
 
   async assignUser(id: string, userName: string) {
killedBy: TasksService should update task deadline
statusReason: PrismaClientKnownRequestError: 
Invalid `prisma.project.create()` invocation in
/Users/jestak/WebstormProjects/NodeJS-Course3/.stryker-tmp/sandbox-6iIzKe/src/tasks/tasks.service.integration.spec.ts:132:42

  129 it('should update task deadline', async () => {
  130   const newDate = new Date('2024-12-31');
  131 
→ 132   const project = await prisma.project.create(

[Killed] ObjectLiteral
src/tasks/tasks.service.ts:62:14
 
   async updateDeadline(id: string, date: Date) {
     return this.prisma.task.update({
-      where: { id },
+      where: {},
       data: { deadline: date },
     });
killedBy: TasksService should update task deadline
statusReason: PrismaClientValidationError: 
Invalid `this.prisma.task.update()` invocation in
/Users/jestak/WebstormProjects/NodeJS-Course3/.stryker-tmp/sandbox-6iIzKe/src/tasks/tasks.service.ts:133:31

  130   {}
  131 } else {
  132   stryCov_9fa48("64");
→ 133   return this.prisma.task.update({

[Killed] BlockStatement
src/tasks/tasks.service.ts:67:50
     });
   }
 
-  async assignUser(id: string, userName: string) {
-    const task = await this.findOne(id);
-    if (!task) return undefined;
-
-    return this.prisma.task.update({
-      where: { id },
-      data: {
-        assignedTo: userName,
-      },
-    });
-  }
+  async assignUser(id: string, userName: string) {}
 
   async getProjectProgress(projectId: string) {
killedBy: TasksService should assign user to task
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "user1"
Received: undefined

[Killed] ConditionalExpression
src/tasks/tasks.service.ts:69:9
 
   async assignUser(id: string, userName: string) {
     const task = await this.findOne(id);
-    if (!task) return undefined;
+    if (true) return undefined;
 
     return this.prisma.task.update({
killedBy: TasksService should assign user to task
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "user1"
Received: undefined

[Killed] BooleanLiteral
src/tasks/tasks.service.ts:69:9
 
   async assignUser(id: string, userName: string) {
     const task = await this.findOne(id);
-    if (!task) return undefined;
+    if (task) return undefined;
 
     return this.prisma.task.update({
killedBy: TasksService should assign user to task
statusReason: PrismaClientKnownRequestError: 
Invalid `prisma.task.create()` invocation in
/Users/jestak/WebstormProjects/NodeJS-Course3/.stryker-tmp/sandbox-6iIzKe/src/tasks/tasks.service.integration.spec.ts:163:36

  160   },
  161 });
  162 
→ 163 const task = await prisma.task.create(

[Killed] ObjectLiteral
src/tasks/tasks.service.ts:73:13
 
     return this.prisma.task.update({
       where: { id },
-      data: {
-        assignedTo: userName,
-      },
+      data: {},
     });
   }
killedBy: TasksService should assign user to task
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "user1"
Received: null

[Killed] BlockStatement
src/tasks/tasks.service.ts:79:47
     });
   }
 
-  async getProjectProgress(projectId: string) {
-    const [total, completed] = await Promise.all([
-      this.prisma.task.count({ where: { projectId } }),
-      this.prisma.task.count({
-        where: { projectId, status: 'done' },
-      }),
-    ]);
-
-    if (total === 0) return undefined;
-    return completed / total;
-  }
+  async getProjectProgress(projectId: string) {}
 
   async getEpisodeProgress(projectId: string, episodeNumber: number) {
killedBy: TasksService should get project progress
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0.25
Received: undefined

[Killed] ObjectLiteral
src/tasks/tasks.service.ts:81:30
 
   async getProjectProgress(projectId: string) {
     const [total, completed] = await Promise.all([
-      this.prisma.task.count({ where: { projectId } }),
+      this.prisma.task.count({}),
       this.prisma.task.count({
         where: { projectId, status: 'done' },
killedBy: TasksService should get project progress
statusReason: Error: expect(jest.fn()).toHaveBeenNthCalledWith(n, ...expected)

n: 1
Expected: {"where": {"projectId": "project1"}}
Received
->     1
        - Object {
        -   "where": Object {

[Killed] ObjectLiteral
src/tasks/tasks.service.ts:81:39
 
   async getProjectProgress(projectId: string) {
     const [total, completed] = await Promise.all([
-      this.prisma.task.count({ where: { projectId } }),
+      this.prisma.task.count({ where: {} }),
       this.prisma.task.count({
         where: { projectId, status: 'done' },
killedBy: TasksService should get project progress
statusReason: Error: expect(jest.fn()).toHaveBeenNthCalledWith(n, ...expected)

n: 1
Expected: {"where": {"projectId": "project1"}}
Received
->     1
          Object {
        -   "where": Object {

[Killed] ObjectLiteral
src/tasks/tasks.service.ts:82:30
   async getProjectProgress(projectId: string) {
     const [total, completed] = await Promise.all([
       this.prisma.task.count({ where: { projectId } }),
-      this.prisma.task.count({
-        where: { projectId, status: 'done' },
-      }),
+      this.prisma.task.count({}),
     ]);
 
killedBy: TasksService should get project progress
statusReason: Error: expect(jest.fn()).toHaveBeenNthCalledWith(n, ...expected)

n: 2
Expected: {"where": {"projectId": "project1", "status": "done"}}
Received
       1: {"where": {"projectId": "project1"}}
->     2
        - Object {

[Killed] StringLiteral
src/tasks/tasks.service.ts:83:37
     const [total, completed] = await Promise.all([
       this.prisma.task.count({ where: { projectId } }),
       this.prisma.task.count({
-        where: { projectId, status: 'done' },
+        where: { projectId, status: "" },
       }),
     ]);
killedBy: TasksService should get project progress
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0.25
Received: 0

[Timeout] ConditionalExpression
src/tasks/tasks.service.ts:87:9
       }),
     ]);
 
-    if (total === 0) return undefined;
+    if (false) return undefined;
     return completed / total;
   }

[Timeout] ConditionalExpression
src/tasks/tasks.service.ts:87:9
       }),
     ]);
 
-    if (total === 0) return undefined;
+    if (true) return undefined;
     return completed / total;
   }

[Killed] ArithmeticOperator
src/tasks/tasks.service.ts:88:12
     ]);
 
     if (total === 0) return undefined;
-    return completed / total;
+    return completed * total;
   }
 
killedBy: TasksService should get project progress
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0.25
Received: undefined

[Killed] BlockStatement
src/tasks/tasks.service.ts:91:70
     return completed / total;
   }
 
-  async getEpisodeProgress(projectId: string, episodeNumber: number) {
-    const [total, completed] = await Promise.all([
-      this.prisma.task.count({
-        where: { projectId, episodeNumber },
-      }),
-      this.prisma.task.count({
-        where: { projectId, episodeNumber, status: 'done' },
-      }),
-    ]);
-
-    if (total === 0) return 0;
-    return completed / total;
-  }
+  async getEpisodeProgress(projectId: string, episodeNumber: number) {}
 
   async findOverdueTasks() {
killedBy: TasksService should get episode progress
statusReason: Error: expect(jest.fn()).toHaveBeenNthCalledWith(n, ...expected)

n: 1
Expected: {"where": {"episodeNumber": 1, "projectId": "project1"}}

Number of calls: 0

[Killed] ObjectLiteral
src/tasks/tasks.service.ts:96:30
       this.prisma.task.count({
         where: { projectId, episodeNumber },
       }),
-      this.prisma.task.count({
-        where: { projectId, episodeNumber, status: 'done' },
-      }),
+      this.prisma.task.count({}),
     ]);
 
killedBy: TasksService should get episode progress
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0.5
Received: 1.5

[Killed] StringLiteral
src/tasks/tasks.service.ts:97:52
         where: { projectId, episodeNumber },
       }),
       this.prisma.task.count({
-        where: { projectId, episodeNumber, status: 'done' },
+        where: { projectId, episodeNumber, status: "" },
       }),
     ]);
killedBy: TasksService should get episode progress
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0.5
Received: 0

[Killed] ConditionalExpression
src/tasks/tasks.service.ts:101:9
       }),
     ]);
 
-    if (total === 0) return 0;
+    if (true) return 0;
     return completed / total;
   }
killedBy: TasksService should get episode progress
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0.5
Received: 0

[Timeout] EqualityOperator
src/tasks/tasks.service.ts:101:9
       }),
     ]);
 
-    if (total === 0) return 0;
+    if (total !== 0) return 0;
     return completed / total;
   }

[Killed] ArithmeticOperator
src/tasks/tasks.service.ts:102:12
     ]);
 
     if (total === 0) return 0;
-    return completed / total;
+    return completed * total;
   }
 
killedBy: TasksService should get episode progress
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0.5
Received: 2

[Timeout] BlockStatement
src/tasks/tasks.service.ts:105:28
     return completed / total;
   }
 
-  async findOverdueTasks() {
-    const now = new Date();
-
-    return this.prisma.task.findMany({
-      where: {
-        deadline: { lt: now },
-        status: { not: 'done' },
-      },
-    });
-  }
+  async findOverdueTasks() {}
 }
 

[Timeout] ObjectLiteral
src/tasks/tasks.service.ts:108:38
   async findOverdueTasks() {
     const now = new Date();
 
-    return this.prisma.task.findMany({
-      where: {
-        deadline: { lt: now },
-        status: { not: 'done' },
-      },
-    });
+    return this.prisma.task.findMany({});
   }
 }

[Killed] ObjectLiteral
src/tasks/tasks.service.ts:109:14
     const now = new Date();
 
     return this.prisma.task.findMany({
-      where: {
-        deadline: { lt: now },
-        status: { not: 'done' },
-      },
+      where: {},
     });
   }
killedBy: TasksService should find overdue tasks
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 4
